iccd332ArqComp-2024-B/Talleres/Taller-PresentacionLatchesFlipFlops.tex
% Created 2026-06-11 Thu 08:59
% Intended LaTeX compiler: pdflatex
\documentclass[presentation]{beamer}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[T1]{fontenc}
\usepackage[utf8]{inputenc}
\usepackage[spanish]{babel}
\usepackage[backend=biber,autolang=other]{biblatex}
\addbibresource{/home/mateoijt-epn/RepPersonalClase/EPN-Lectures-Personal/iccd332ArqComp-2024-B/bibliography.bib}
\usepackage{booktabs}
\usepackage{xcolor}
\usetheme{Madrid}
\usecolortheme{}
\usefonttheme{}
\useinnertheme{}
\useoutertheme{}
\author{Echeverría Steven, Jami Mateo, Pérez Martín y Zúñiga Sebastián}
\date{2026-06-11}
\title{Latches y Flip-Flops}
\subtitle{ICCD332 — Arquitectura de Computadores}

\hypersetup{
 pdfauthor={Echeverría Steven, Jami Mateo, Pérez Martín y Zúñiga Sebastián},
 pdftitle={Latches y Flip-Flops},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.1 (Org mode 9.7.5)}, 
 pdflang={Spanish}}
\begin{document}

\maketitle
\begin{frame}{Outline}
\tableofcontents
\end{frame}


\section{Introducción}
\label{sec:org52c943c}

\begin{frame}[label={sec:orga4571a3}]{Latches y Flip-Flops}
\begin{columns}
\begin{column}{0.48\columnwidth}
\begin{itemize}
\item \alert{Integrantes:}
\begin{itemize}
\item Echeverría Steven
\item Jami Mateo
\item Pérez Martín
\item Zúñiga Sebastián
\end{itemize}
\item \alert{Fecha:} 2026-06-11
\item \alert{Curso:} ICCD332 — Arquitectura de Computadores
\end{itemize}
\end{column}

\begin{column}{0.52\columnwidth}
\begin{itemize}
\item \alert{Video de referencia:}
\href{https://youtu.be/JEPmmHYD\_Ss?si=GWVx3Kj8el1FyktM}{Circuitos Secuenciales}

\item \alert{Bibliografía de apoyo:}
\begin{itemize}
\item \autocite{stallings2022eng} en página 438 del PDF

\item \autocite{stallings2006esp} en página 758 del PDF
\end{itemize}
\end{itemize}
\end{column}
\end{columns}
\end{frame}

\begin{frame}[label={sec:orgd6aeef4}]{¿Por qué son importantes los circuitos de memoria?}
\begin{itemize}
\item\relax [Punto 1: ¿qué diferencia a un circuito combinacional de uno secuencial?
Incluya la ecuación  Q(t+1) = f(entradas, Q(t))]
\item\relax [Punto 2: Para el funcionamiento de un computador con arquitectura
de Von Neumann, ¿se requiere de lógica secuencial? Explique su respuesta.]
\end{itemize}
\end{frame}

\section{Latches}
\label{sec:org312f7be}

\begin{frame}[label={sec:org5d7824f}]{Latch SR con Puertas NOR}
\begin{columns}
\begin{column}{0.55\columnwidth}
\begin{itemize}
\item Este circuito secuencial se construye cruzando dos compuertas lógicas NOR, de manera que las salidas de cada compuerta se conecta a una de las entradas de la otra.
\item Posee dos entradas \(S\) (set) y \(R\) (reset) que se activan u operan con 1 lógico.
\item A su vez, tiene dos salidas \(Q\) (la principal) y \(Q'\) (su inverso) las cuales son complementarias, es decir, si una tiene 1 lógico, la otra tendrá 0, y viceversa.
\item Estado SET:      \(S=1,\,R=0 \;\Rightarrow\; Q=[?]\) (Activa la salida)
\item Estado RESET:    \(S=0,\,R=1 \;\Rightarrow\; Q=[?]\) (Limpia la salida)
\item Estado HOLD:     \(S=0,\,R=0 \;\Rightarrow\; Q=[?]\) (Mantiene el estado anterior)
\item Estado \textcolor{red}{PROHIBIDO}: \(S=1,\,R=1\). Es inválido porque provoca que tanto \(Q\) como \(Q'\) sean 0, lo que no tiene sentido al ser complementarios.
\end{itemize}
\end{column}

\begin{column}{0.45\columnwidth}
\begin{center}
\begin{tabular}{rrrrl}
\(S\) & \(R\) & \(Q\) & \(\overline{Q}\) & Estado\\[0pt]
\hline
0 & 0 & \(Q(t)\) & \(\overline{Q}\) & Sin cambios\\[0pt]
0 & 1 & 0 & 1 & Reset\\[0pt]
1 & 0 & 1 & 0 & Set\\[0pt]
1 & 1 & 0 & 0 & Prohibido\\[0pt]
\end{tabular}
\end{center}
\end{column}
\end{columns}
\end{frame}

\begin{frame}[label={sec:orge5d45eb}]{Latch SR con Puertas NAND}
\begin{columns}
\begin{column}{0.55\columnwidth}
\begin{itemize}
\item Este circuito secuencial sustituye las compuertas lógicas NOR por las NAND, pero mantiene la retroalimentación cruzada (salida de una conectada a la otra).
\item La diferencia principal con respecto al anterior es que se trabaja en bajo, es decir, \(S\) y \(R\) se activan con 0 lógico.
\item Entradas activas en \textcolor{blue}{bajo}:
\(\overline{S}\) y \(\overline{R}\)
\item Estado \textcolor{red}{PROHIBIDO}: \(\overline{S}=[?],\;\overline{R}=[?]\). Fuerza a que ambas salidas sean 1 al mismo tiempo, lo que rompe la lógica de ser complementarios.
\end{itemize}
\end{column}

\begin{column}{0.45\columnwidth}
\begin{center}
\begin{tabular}{rrrrl}
\(\overline{S}\) & \(\overline{R}\) & \(Q\) & \(\overline{Q}\) & Estado\\[0pt]
\hline
0 & 0 & 1 & 1 & Prohibido\\[0pt]
0 & 1 & 1 & 0 & Set\\[0pt]
1 & 0 & 0 & 1 & Reset\\[0pt]
1 & 1 & \(Q(t)\) & \(\overline{Q}\) & Sin cambios\\[0pt]
\end{tabular}
\end{center}
\end{column}
\end{columns}
\end{frame}
\begin{frame}[label={sec:org35b9b27}]{Latch SR con Habilitación}
\begin{columns}
\begin{column}{0.55\columnwidth}
La señal de habilitación enable (EN) indica cuándo
las entradas S y R modifican la salida Q, de modo que no exista cambio
alguno en Q si enable permanece inactiva. Es decir, si EN = 0, no hay
cambios en el circuito aun cuando las señales entrantes se alteren.

Por el contrario, cuando EN = 1, el latch SR funciona normalmente dado
que el circuito se encuentra habilitado.

\begin{itemize}
\item Se agrega una señal de control: \alert{Enable} (\(EN\))
\item \(EN=0\): entradas bloqueadas → \(Q(t+1)= Q(t)\)
\item \(EN=1\): funciona como Latch SR normal
\item Aparte de las compuertas NOR o NAND, integradas en el latch S-R, se emplean dos compuertas NAND adicionales para poder implementar
enable. La distribución de entradas en cada compuerta se realiza de
la siguiente manera:
\begin{enumerate}
\item Entrada S y EN
\item EN y entrada R
\end{enumerate}
\end{itemize}
\end{column}

\begin{column}{0.45\columnwidth}
\begin{center}
\begin{tabular}{rrrrl}
\(EN\) & \(S\) & \(R\) & \(Q(t+1)\) & Estado\\[0pt]
\hline
0 & X & X & Q(t) & Sin cambios\\[0pt]
1 & 0 & 0 & Q(t) & Sin cambios\\[0pt]
1 & 0 & 1 & 0 & Reset\\[0pt]
1 & 1 & 0 & 1 & Set\\[0pt]
1 & 1 & 1 & 1 & Prohibido\\[0pt]
\end{tabular}
\end{center}
\end{column}
\end{columns}
\end{frame}

\begin{frame}[label={sec:orgc76f768}]{Latch D con Habilitación}
\begin{columns}
\begin{column}{0.55\columnwidth}
El latch D es un circuito secuencial que, a diferencia del SR, posee
una entrada para las señales, llamada D, y otra para la habilitación,
cuyo nombre es enable (EN). Además, este latch emplea las siguientes
combinaciones de compuertas lógicas:
\begin{itemize}
\item NAND si las entradas están conectadas a compuertas NAND
\item AND si las entradas están conectadas a compuertas NOR
\end{itemize}

Adicionalmente, la entrada D se conecta a una compuerta NOT, que a su
vez está conectada a una de las compuertas NAND o AND. Debido a esto,
el comportamiento de este latch es similar a tener una entrada S y
otra R', lo cual elimina la posibilidad de que haya un estado prohibido.

\begin{itemize}
\item Se obtiene haciendo \(R = \overline{D}\) en el Latch SR con EN
\item Elimina el estado \textcolor{red}{prohibido}
\item \(EN=1\) (transparente): \(Q(t+1)=D\)
\item \(EN=0\) (retención):    \(Q(t+1)=Q(t)\)
\item Cuando EN = 1, cualquier cambio que se realice en la entrada D se
reflejará automáticamente en la salida Q. Este efecto se conoce como
transparencia, puesto que el estado de Q siempre es equivalente al
de la entrada D cuando el circuito se encuentra habilitado.
\end{itemize}
\end{column}

\begin{column}{0.45\columnwidth}
\begin{center}
\begin{tabular}{rrrl}
\(EN\) & \(D\) & \(Q(t+1)\) & Estado\\[0pt]
\hline
0 & X & Q(t) & Sin cambios\\[0pt]
1 & 0 & 0 & Reset\\[0pt]
1 & 1 & 1 & Set\\[0pt]
\end{tabular}
\end{center}
\end{column}
\end{columns}
\end{frame}

\section{Flip-Flop D}
\label{sec:org7ae6d22}

\begin{frame}[label={sec:org43a4126}]{Flip-Flop D: Disparo por Flanco}
\begin{columns}
\begin{column}{0.55\columnwidth}
\begin{itemize}
\item \alert{Latch D:} activo mientras \(EN=1\)
\item \alert{FF D:}    activo solo en el flanco de subida ↑ de CLK
\item Ventaja: evita race conditions porque la ventana de
captura es infinitamente corta.
\item Ecuación:
\[Q(t+1) = D \quad \text{(en el flanco de CLK)}\]
\end{itemize}
\end{column}

\begin{column}{0.45\columnwidth}
\begin{center}
\begin{tabular}{rrl}
\(D\) & \(Q(t+1)\) & Estado\\[0pt]
\hline
0 & 0 & reset\\[0pt]
1 & 1 & set\\[0pt]
\end{tabular}
\end{center}
\end{column}
\end{columns}
\end{frame}

\begin{frame}[label={sec:orgeba718a}]{El Circuito Integrado 74LS74}
\end{frame}

\section{Descripción del CI\hfill{}\textsc{BMCOL}}
\label{sec:org1ef7131}
\begin{itemize}
\item Contiene [2] Flip-Flops D en un encapsulado DIP-14, los cuales
pueden ser usados individualmente. Este circuito por sí solo puede
almacena dos bits, uno por cada flip-flop.
\item Pines de cada FF:
\begin{itemize}
\item D:   [Es la entrada a cada flip-flop que representa el dato principal a almacenar.]
\item CLK: disparo por [flanco ↑ (de subida).]
\item PRE: [activo en bajo, si CLR está en alto: ignora la entrada D y se tiene como salida
Q un 1 lógico.]
\item CLR: [activo en bajo, si PRE está en alto: ignora la entrada D y
la salida Q queda en bajo.]
\item Q y \(\overline{Q}\): [son las salidas del flip-flop que reflejan
el bit almacenado y su complemento.]
\item PRE y CLR son [asíncronos]: actúan [sin] el reloj
\end{itemize}
\item Es un circuito de la familia lógica TTL, contiene 14 pines, donde
uno corresponde al VCC que se debe conectar a la alimentación de
+5V.
\item La corriente máxima que se puede extraer de un pin de salida es de
tan solo 0,4 mA cuando el pin está en alto o de 8 mA cuando está en bajo.
\end{itemize}

\section{Tabla de Función\hfill{}\textsc{BMCOL}}
\label{sec:org374ffb8}
\begin{center}
\begin{tabular}{rrllll}
PRE & CLR & CLK & \(D\) & \(Q\) & \(\overline{Q}\)\\[0pt]
\hline
0 & 1 & X & X & [1] & [0]\\[0pt]
1 & 0 & X & X & [0] & [1]\\[0pt]
0 & 0 & X & X & [1] & [1]\\[0pt]
1 & 1 & ↑ & 0 & [0] & [1]\\[0pt]
1 & 1 & ↑ & 1 & [1] & [0]\\[0pt]
\end{tabular}
\end{center}
\section{Conclusiones}
\label{sec:org883bdfd}

\begin{frame}[allowframebreaks]{Lo que aprendimos y hacia dónde seguir}
\alert{Progresión estudiada:}

\begin{center}
SR (NOR/NAND) \(\;\longrightarrow\;\) SR + Habilitación \(\;\longrightarrow\;\)
Latch D \(\;\longrightarrow\;\) Flip-Flop D \(\;\longrightarrow\;\) 74LS74
\end{center}

\alert{Conclusión del grupo:}
\begin{itemize}
\item Primero se estudió el Latch SR, el cual permite almacenar un bit de información sin depender de una señal de reloj, por lo que se considera un circuito asíncrono. Posteriormente, se añadió una entrada EN (Enable) que permite habilitar o bloquear la modificación del valor lógico almacenado.
\end{itemize}

Más adelante, las entradas S y R se reemplazan por una única entrada D (Data) mediante una configuración lógica que evita los estados no válidos del latch SR, obteniéndose así un Latch D con habilitación.

Finalmente, se introduce una señal de reloj CLK, dando lugar al Flip-Flop D (FF D). Este corresponde a un circuito secuencial síncrono, ya que actualiza su salida únicamente cuando ocurre un flanco específico de la señal de reloj (comúnmente el flanco de subida). En ese instante, el valor presente en la entrada D es transferido y almacenado en la salida.
\end{frame}


\section{Referencias}
\label{sec:org268c239}

\begin{frame}[allowframebreaks]{Referencias}
\printbibliography
\end{frame}
\end{document}
